RIET/src/DataProcessors/PreAlertLoading/PreAlertLoading.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>PreAlertLoading</name>
</mdclass:DataProcessor>

RIET/src/Documents/Trip/Trip.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Trip</name>
  <registerRecords>AccumulationRegister.LocalDistributionCostsMilageWeightVolume</registerRecords>
  <registerRecords>AccumulationRegister.LocalDistributionCostsPerItem</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>AccumulationRegister.LocalDistributionCostsPerKG</registerRecords>
  <registerRecords>AccumulationRegister.LocalDistributionAccessorialCostsPerItem</registerRecords>
  <attributes>
    <name>WarehouseFrom</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Draft</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Final</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Equipment</name>
    <type>
      <types>CatalogRef.Equipments</types>
    </type>
  </attributes>
  <attributes>
    <name>EquipmentNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ETD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ATD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceProvider</name>
    <type>
      <types>CatalogRef.ServiceProviders</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossWeightKG</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CubicMeters</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DomesticOBSentToTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseToList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DaysETAWithoutATA</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DomesticOBSentToTMSDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Specialist</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>TotalCostsSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalAccessorialCostsSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BaseCostsSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZeroBaseCostsSum</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BaseCostsSumSLBUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalCostsSumUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalAccessorialCostsSumUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TypeOfTransport</name>
    <type>
      <types>EnumRef.TypesOfTransport</types>
    </type>
  </attributes>
  <attributes>
    <name>Transport</name>
    <type>
      <types>CatalogRef.Transport</types>
    </type>
  </attributes>
  <attributes>
    <name>DontSendInTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Parcels</name>
    <attributes>
      <name>Parcel</name>
      <type>
        <types>CatalogRef.Parcels</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>FinalDestinations</name>
    <attributes>
      <name>WarehouseTo</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalEntity</name>
      <type>
        <types>CatalogRef.LegalEntities</types>
      </type>
    </attributes>
    <attributes>
      <name>Waybill</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ETA</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ATA</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Mileage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DomesticOB</name>
    <attributes>
      <name>OBNo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>WarehouseTo</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>Urgency</name>
      <type>
        <types>EnumRef.Urgencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Gold</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalEntity</name>
      <type>
        <types>CatalogRef.LegalEntities</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Activity</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Costs</name>
    <attributes>
      <name>CostType</name>
      <type>
        <types>CatalogRef.AccessorialCosts</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/DataProcessors/PreAlertLoading/Forms/Форма/Module.bsl
//////////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыбратьФайл();
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////
// ВЫБОР ФАЙЛА

&НаКлиенте
Процедура FullPathНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбратьФайл();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайл()
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр						= "Files xls (*.xls)|*.xls|Files xlsx (*.xlsx)|*.xlsx";
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	= Истина;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		FullPath = ДиалогВыбораФайла.ПолноеИмяФайла;
				
	КонецЕсли;
		
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////
// ЗАГРУЗКА

#Если не ВебКлиент Тогда
&НаКлиенте
Процедура Load(Команда)
	
	Если НЕ ЗначениеЗаполнено(FullPath) Тогда
		
		ВыбратьФайл();
		
		Если НЕ ЗначениеЗаполнено(FullPath) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Select file!",
				, "Объект", "FullPath");
				Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	 
	Состояние("Loading file...");
	
	Если НЕ РГСофтКлиентСервер.ФайлДоступенДляЗагрузки(FullPath) Тогда
		Возврат;
	КонецЕсли;
	
	БылиОшибки = Ложь;
	
	МассивLocalParcels = ПолучитьМассивLocalParcelsИзФайла(БылиОшибки, FullPath);
	
	Если Не БылиОшибки Тогда
		СоздатьTrip(БылиОшибки, МассивLocalParcels);
	КонецЕсли;
	
	Если БылиОшибки Тогда 
		Предупреждение("There were errors during Pre-alert loading.
			|See them on the right pane.", 60);	
	Иначе 	
		Предупреждение("Success.");
 	КонецЕсли;
    			
КонецПроцедуры

       
&НаКлиенте
Функция ПолучитьМассивLocalParcelsИзФайла(БылиОшибки, FullPath)
	
	Файл = Новый Файл(FullPath);
	ПолноеИмяФайла = Неопределено;
	РасширениеФайла = НРег(Файл.Расширение);
	
	Если РасширениеФайла = ".xls" или РасширениеФайла = ".xlsx" Тогда
		ПолноеИмяФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
		КопироватьФайл(FullPath, ПолноеИмяФайла);
	КонецЕсли;
	       			
	Connection = Новый COMОбъект("ADODB.Connection");
	СтрокаПодключения = "Provider=Microsoft.ACE.OLEDB.12.0;Data Source=" + ПолноеИмяФайла + ";Extended Properties=""Excel 12.0;HDR=No;IMEX=1""";	
	
	Попытка 
		Connection.Open(СтрокаПодключения);	
	Исключение
		Попытка
			СтрокаПодключения = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source=" + ПолноеИмяФайла + ";Extended Properties=""Excel 8.0;HDR=No;IMEX=1""";
			Connection.Open(СтрокаПодключения);
		Исключение
			Сообщить(ОписаниеОшибки());
			БылиОшибки = Истина;
		КонецПопытки;
	КонецПопытки;
		
	rs = Новый COMObject("ADODB.RecordSet");
	rs.ActiveConnection = Connection;
	rs = Connection.OpenSchema(20);
	
	ЛистЭксель = rs.Fields("TABLE_NAME").Value;
	
	sqlString = "select * from [" + ЛистЭксель + "]";
	rs.Close();
	rs.Open(sqlString);
	
	rs.MoveFirst();
	   	 	
	СвойстваСтруктуры = "ParcelNo,ImportLocal";
	СтруктураЗначенийСтроки = Новый Структура(СвойстваСтруктуры);
	
	МассивParcelNos = Новый Массив;
	
	НомерСтроки = 0;
	Пока rs.EOF = 0 Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		Если НомерСтроки = 3 Тогда 
			
			СтруктураИменИНомеровКолонок = ПолучитьСтруктуруИменИНомеровКолонок(rs, СвойстваСтруктуры, БылиОшибки);
			
			Если БылиОшибки Тогда 
				Прервать;
			КонецЕсли;
			
			rs.MoveNext();
			Продолжить;
			
		ИначеЕсли НомерСтроки > 3 Тогда
			
			//добавляем значение каждой ячейки файла в структуру значений
			Для Каждого ЭлементСтруктуры из СтруктураИменИНомеровКолонок Цикл 
				
				ЗначениеЯчейки = rs.Fields(ЭлементСтруктуры.Значение-1).Value;
				СтруктураЗначенийСтроки[ЭлементСтруктуры.Ключ] = ЗначениеЯчейки;
				
			КонецЦикла;
			
			СтруктураЗначенийСтроки.ParcelNo = СокрЛП(СтруктураЗначенийСтроки.ParcelNo);
			СтруктураЗначенийСтроки.ImportLocal = СокрЛП(СтруктураЗначенийСтроки.ImportLocal);
			
			Если Не ЗначениеЗаполнено(СтруктураЗначенийСтроки.ParcelNo) Тогда 
				Прервать;
			КонецЕсли;
			
			//Если Не ЗначениеЗаполнено(ДатаTrip) И ЗначениеЗаполнено(СтруктураЗначенийСтроки.Дата) Тогда 
			//	ДатаTrip = СтруктураЗначенийСтроки.Дата;
			//КонецЕсли;
			
			//можно идентифицировать импортные грузы по значению OIES в колонке «Клиент Документ Но. Приемки». Все остальное получается не импорт.
			Если СтруктураЗначенийСтроки.ImportLocal = "OIES" Тогда 
				rs.MoveNext();
				Продолжить;
			КонецЕсли;
			
			//В столбце СН Грузоместа (Mjr) все серийные номера грузомест начинающиеся с «W» являются «реальными», например - W14078793, W14078808. 
			//Все остальные являются «виртуальными».
			Если Лев(СтруктураЗначенийСтроки.ParcelNo, 1) <> "W" Тогда
				rs.MoveNext();
				Продолжить;
			КонецЕсли;
			
			//добавим ParcelNo
			Если МассивParcelNos.Найти(СтруктураЗначенийСтроки.ParcelNo) = Неопределено Тогда 
				МассивParcelNos.Добавить(СтруктураЗначенийСтроки.ParcelNo);
			КонецЕсли; 
			
		КонецЕсли;
		
		rs.MoveNext();
		
	КонецЦикла;
	
	rs.Close();
	Connection.Close();
	
	//проверим, что есть локальные парсели
	Если МассивParcelNos.Количество() = 0 Тогда 
		Сообщить("Failed to find local parcels in current file!");
		БылиОшибки = Истина;
	КонецЕсли;
		
	//проверим, что все локальные парсели уже загружены
	МассивParcels = ПолучитьМассивParcels(БылиОшибки, МассивParcelNos);
	
	УдалитьФайлы(ПолноеИмяФайла);
	
	Возврат МассивParcels;
	
КонецФункции

#КонецЕсли

&НаСервереБезКонтекста
Функция ПолучитьМассивParcels(БылиОшибки, МассивParcelNos)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивParcelNos", МассивParcelNos);

	Запрос.Текст = "ВЫБРАТЬ
	               |	Parcels.Ссылка КАК Parcel,
	               |	ВЫРАЗИТЬ(Parcels.Код КАК СТРОКА(30)) КАК ParcelNo
	               |ИЗ
	               |	Справочник.Parcels КАК Parcels
	               |ГДЕ
	               |	ВЫРАЗИТЬ(Parcels.Код КАК СТРОКА(30)) В (&МассивParcelNos)
	               |	И Parcels.Проверен";
	
	ТЗParcels = Запрос.Выполнить().Выгрузить();
	РГСофтКлиентСервер.СокрЛПКолонокВТаблице(ТЗParcels, "ParcelNo");
	
	МассивParcels = Новый Массив;
	Для Каждого ParcelNo из МассивParcelNos Цикл 
				
		СтрокаParcel = ТЗParcels.Найти(ParcelNo, "ParcelNo");
		
		Если СтрокаParcel = Неопределено Тогда 
			Сообщить("Failed to find local parcel no. '" + ParcelNo + "'!");
			БылиОшибки = Истина;
			Продолжить;	
		КонецЕсли;
		
		Если МассивParcels.Найти(СтрокаParcel.Parcel) = Неопределено Тогда 
			МассивParcels.Добавить(СтрокаParcel.Parcel);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивParcels;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруИменИНомеровКолонок(rs, СвойстваСтруктуры, БылиОшибки)
	
	СтруктураКолонокИИндексов = Новый Структура(СвойстваСтруктуры);
	
	НомерКолонки = 1;
	Для Каждого Field из rs.Fields Цикл 
		
		ТекстЯчейки = СокрЛП(Field.Value);
		Если НЕ ЗначениеЗаполнено(ТекстЯчейки) Тогда
			Прервать;
		КонецЕсли; 
		
		Если ТекстЯчейки = "СН Грузоместа (Mjr)" Тогда
			СтруктураКолонокИИндексов.ParcelNo = НомерКолонки;
		ИначеЕсли ТекстЯчейки = "Клиент Документ Но. Приемки" Тогда
			СтруктураКолонокИИндексов.ImportLocal = НомерКолонки;
		КонецЕсли;   
		
		НомерКолонки = НомерКолонки + 1;
		
	КонецЦикла; 
	
	Для Каждого КлючИЗначение Из СтруктураКолонокИИндексов Цикл
		
		Если КлючИЗначение.Значение = Неопределено Тогда
			Сообщить("Необходимо проверить наличие колонки с данными '" + КлючИЗначение.Ключ + "'!");
			БылиОшибки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураКолонокИИндексов;
	
КонецФункции

&НаКлиенте
Процедура СоздатьTrip(БылиОшибки, МассивLocalParcels) 
	                  		     	
	//НовыйTrip = Документы.Trip.СоздатьДокумент();
	//
	//НовыйTrip.WarehouseFrom = Справочники.Warehouses.НайтиПоКоду("RUS_MJRM");
	//Если Не ЗначениеЗаполнено(НовыйTrip.WarehouseFrom) Тогда
	//	ТекстОшибок = ТекстОшибок + "Failed to find warehouse by code 'RUS_MJRM'!";
	//иначе
	//	НовыйTrip.ServiceProvider = Справочники.ServiceProviders.НайтиПоРеквизиту("DefaultWarehouse", НовыйTrip.WarehouseFrom);
	//	Если Не ЗначениеЗаполнено(НовыйTrip.ServiceProvider) Тогда
	//		ТекстОшибок = ТекстОшибок + "Failed to find Service provider by default warehouse '" + СокрЛП(НовыйTrip.WarehouseFrom) + "'!";
	//	КонецЕсли;
	//КонецЕсли;
	//
	//НовыйTrip.Equipment = Справочники.Equipments.НайтиПоНаименованию("Truck");
	//НовыйTrip.Draft = ДатаTrip;
	//НовыйTrip.ETD = ДатаTrip;
	//
	//НовыйTrip.Parcels.ЗагрузитьКолонку(МассивLocalParcels, "Parcel");

	//НовыйTrip.Записать();
		
	// откроем форму Trip
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РежимОткрытияОкна", РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", Новый Структура("МассивParcels", МассивLocalParcels));
	
	ОткрытьФорму("Документ.Trip.ФормаОбъекта", СтруктураПараметров, ЭтаФорма, Истина);
	    	
КонецПроцедуры
